# Standard Taps
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/bundle"

# Core
brew "bash"
brew "zsh"
brew "stow"
brew "vim"
brew "tmux"
brew "reattach-to-user-namespace"

# Git
brew "git"
brew "git-lfs"
brew "tig"
brew "git-filter-repo"

# Helpful
brew "cloc"
brew "tree"

# Shell
brew "shellcheck"
cask "qlstephen" # plaintext files

# iOS Development
brew "carthage"
brew "swiftlint"
cask "provisionql"

# JSON
brew "jq"
cask "quicklook-json"

# Ruby
brew "ruby"

# Python
brew "python"

# Web
brew "coreutils"
brew "multimarkdown"
brew "webfs"

# Images
brew "imagemagick"
brew "ghostscript"
cask "qlimagesize"

# Video
cask "qlvideo"

# Fonts
cask "font-lato"
# cask "font-lobster-two" # Downloads entire Google Fonts repository?!
cask "font-meslo-for-powerline"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "font-vollkorn"

# Speedtest
tap "teamookla/speedtest"
brew "speedtest"